import * as React from "react";
import Img from "../../assets/_DSC2412.png"
import { PageTitle } from "./PageTitle";

export function AboutUsContent() {
  const paragraphs = [
    "ХААН Банк нь харилцагчид, хамтран ажиллагч байгууллагууддаа банк,",
    "санхүүгийн цогц бүтээгдэхүүн, үйлчилгээг цаг хугацаа, орон зайнаас үл",
    "хамааран тасралтгүй хүргэхээр бид зорьж ажиллаж байна. Салбартаа",
    "төдийгүй улсдаа тэргүүлэгч байгууллагын хувьд хүн бүхэнд эрх тэгш",
    "боломжийг санал болгож, амжилтын гараанд хамтдаа өсөн дэвжих боломж",
    "олгон 2023 оны 4-р сард олон нийтэд нээлттэй хувьцаат компани боллоо.",
    "6,500 гаруй ажилтныхаа хичээл зүтгэлийн үр дүнд бид 2.9 сая үнэнч",
    "харилцагчдадаа дэлхийн хаанаас ч банкны бүтээгдэхүүн, үйлчилгээг хүлээн",
    "авах боломжийг бүрдүүлж, байгальд ээлтэй ногоон, цахим банк болох их",
    "аялалд салбартаа түүчээлэн ажиллаж байна.",
    "Өнгөрөгч оны хувьд онцлох үйл явдал бол Монголын хөрөнгийн зах зээлд",
    "хамгийн өндөр дүн бүхий, хамгийн олон хөрөнгө оруулагчтай, хамгийн том",
    "IPO хийснээс гадна дотоодын болон гадаадын хөрөнгийн зах зээлд",
    "Монголын анхны ногоон бондыг гаргалаа. Мөн бизнесийн тасралтгүй үйл",
    "ажиллагаандаа нарны эрчим хүчээр ажилладаг ногоон оффис зэрэг",
    "технологийн дэвшлийг ашигласан шинэчлэлтүүдийг хийж, тогтвортой",
    "санхүүжилт, ногоон зээлийг дэмжин ажиллалаа. 2023 оны эцсийн байдлаар",
    "нийт системийн ногоон зээлийн багцын 47.1%-ийг ХААН Банк дангаар",
    "эзэмшиж буй нь үүнийг баталж байна.",
  ];

  return (
    <article className="mt-10 w-full max-w-6xl mx-auto px-5 lg:px-0">
    <PageTitle/>
    <div className="flex flex-col lg:flex-row gap-10 mx-auto">
        {/* Image Section */}
        <div className="flex justify-center items-center bg-zinc-100 h-[450px] lg:h-[705px] w-full lg:w-[58%] rounded-md">
        <div className="h-[90%] w-[90%] bg-gray-300 rounded-md" role="img" aria-label="About Us Image"></div>
            <img src={Img} alt="About Us Image" className=" ounded-md" />
        </div>

        {/* Content Section */}
        <div className="flex flex-col lg:w-[42%]">
        <section className="text-stone-800">
            <h2 className="text-2xl font-bold text-green-700 mb-4">
            Хамтдаа өсөж, хөгжилд түүчээлсэн 33 жил
            </h2>
            {paragraphs.map((paragraph, index) => (
            <p key={index}>
                {paragraph}
            </p>
            ))}
        </section>
        </div>
    </div>
    </article>

  );
}
